tests/load-test.yml
config:
  target: "http://localhost:3000"  # Alterado para servidor local
  phases:
    - duration: 30  # Reduzido para 30 segundos inicialmente
      arrivalRate: 5  # Reduzido para 5 usuários por segundo
      rampTo: 20     # Reduzido para 20 usuários/segundo
      name: "Teste de carga local"
  variables:
    turmas:
      - "1I01"
      - "1I02"
      - "1I03"
      - "1I04"
      - "1I05"
      - "1I06"
      - "2I01"
      - "2I02"
      - "2I03"
      - "2I04"
      - "2I05"
      - "2I06"
      - "3I01"

scenarios:
  - name: "Fluxo completo de escolha"
    flow:
      # 1. Verificar aluno
      - post:
          url: "/api/verificar-aluno"
          json:
            turma: "{{ $randomItem(turmas) }}"
            nome: "TESTE ALUNO {{ $randomNumber(1, 100) }}"  # Reduzido para 100
          capture:
            - json: "$.verificado"
              as: "verificado"
          expect:
            - statusCode: 200

      # 2. Carregar professores
      - get:
          url: "/api/professores"
          expect:
            - statusCode: 200
            - contentType: "application/json"

      # 3. Salvar preferências
      - post:
          url: "/api/preferencias"
          json:
            turma: "{{ $randomItem(turmas) }}"
            nome: "TESTE ALUNO {{ $randomNumber(1, 100) }}"
            preferencias: ["Professor 1", "Professor 2", "Professor 3"]
          expect:
            - statusCode: 200
            - contentType: "application/json"

      # 4. Verificar preferências salvas
      - get:
          url: "/api/preferencias/{{ $randomItem(turmas) }}/TESTE ALUNO {{ $randomNumber(1, 100) }}"
          expect:
            - statusCode: 200
            - contentType: "application/json"

  # Adicionado monitoramento
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery"